Add project scaffold
